In [5]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [6]:
# Answer:- Five functions of pandas liabrary are as follows
#1) head()
#2) describe()
#3) apply()
#4) loc[]
#5) info()


#Following is a dummy data which represent the daily expenses of the single week
Data = {'Days':['Monday','Tuesday',
               'Wednesday', 'Thursday', 'Friday',
               'Saturday','Sunday'],
       'Daily Expense': [200,167,300,321,243,421,356]}
df1 = pd.DataFrame(Data)
df1

        Days  Daily Expense
0     Monday            200
1    Tuesday            167
2  Wednesday            300
3   Thursday            321
4     Friday            243
5   Saturday            421
6     Sunday            356

In [7]:
df1.head() # shows first 5 records of the dataframe by default

        Days  Daily Expense
0     Monday            200
1    Tuesday            167
2  Wednesday            300
3   Thursday            321
4     Friday            243

In [8]:
df1.describe().T # Statistically summarize the dataframe and gives basic statistics

               count        mean        std    min    25%    50%    75%    max
Daily Expense    7.0  286.857143  89.393192  167.0  221.5  300.0  338.5  421.0

In [9]:
# Applying the 10rs extra to the daily expense column
df1['Daily Expense']=df1['Daily Expense'].apply(lambda x : x+10)

In [10]:
df1

        Days  Daily Expense
0     Monday            210
1    Tuesday            177
2  Wednesday            310
3   Thursday            331
4     Friday            253
5   Saturday            431
6     Sunday            366

In [11]:
df1.loc[2:4] # Locating values present in range from 2nd to 4th index

        Days  Daily Expense
2  Wednesday            310
3   Thursday            331
4     Friday            253

In [12]:
df1.info() # Gives basic info about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Days           7 non-null      object
 1   Daily Expense  7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 240.0+ bytes

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:
import numpy as np
column = ['A','B','C']
def index1(x):
    l1=[]
    for i in range(x):
        if i%2!=0:
            l1.append(i)
        else:
            continue
    return l1
df2 = pd.DataFrame(np.random.rand(5,3),
                   columns = column,
                   index=index1(10))
df2

          A         B         C
1  0.640023  0.771270  0.577793
3  0.845671  0.725121  0.208348
5  0.736539  0.736993  0.630241
7  0.223088  0.975682  0.529704
9  0.714897  0.325470  0.843889

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [14]:
Values = {'Values':
          [12,34,22,43,55,30,43,32]}
df = pd.DataFrame(Values)

def initsum(x):
    return sum(x[0:3:1])
print('The sum of first 3 values of dataframe is :',initsum(df['Values']))
df.head()

The sum of first 3 values of dataframe is : 68

   Values
0      12
1      34
2      22
3      43
4      55

In [15]:
x = [10, 20, 30, 40, 50]
initsum(x)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [148]:
T = {'Text': ['This is a text one', 'My name is Danish', 'Given a Pandas DataFrame df with a column Text',
              'create a new column Word_Count that contains the number of words in each row of the Text column.']}
df2 = pd.DataFrame(T)
def word_count(x):
    return len(x.split())
df2['Word_Count'] = df2.Text.apply(word_count)
df2

                                                Text  Word_Count
0                                 This is a text one           5
1                                  My name is Danish           4
2     Given a Pandas DataFrame df with a column Text           9
3  create a new column Word_Count that contains t...          18

Q5. How are DataFrame.size() and DataFrame.shape() different?

Answer:-Size and shape of a dataframe in pandas python: Size of a dataframe is the number of fields in the dataframe which is nothing but number of rows * number of columns. Shape of a dataframe gets the number of rows and number of columns of the dataframe.

In [17]:
Data = {'Days':['Monday','Tuesday',
               'Wednesday', 'Thursday', 'Friday',
               'Saturday','Sunday'],
       'Daily Expense': [200,167,300,321,243,421,356]}
Data = pd.DataFrame(data=Data)
Data.shape

(7, 2)

In [18]:
Data.size

14

Q6. Which function of pandas do we use to read an excel file?

Answer:- In Pandas we use pd.read_excel() function to read through an excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [19]:
emails1 = {'Emails':['john.doe@example.com','danish.khan@gmail.com',
                    'someone.somewhere@outlook.com','anybody.someone@example.com',
                    'guy.you@outlook.com']}
def usernames(x):
    return x.split(sep="@")[0]
df2 = pd.DataFrame(data=emails1)
df2['Username'] = df2['Emails'].apply(usernames)
df2

                          Emails           Username
0           john.doe@example.com           john.doe
1          danish.khan@gmail.com        danish.khan
2  someone.somewhere@outlook.com  someone.somewhere
3    anybody.someone@example.com    anybody.someone
4            guy.you@outlook.com            guy.you

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [20]:
data2 = {'A':[3,8,6,2,9],
         'B':[5,2,9,3,1],
         'C':[1,7,4,5,2]}
df3 = pd.DataFrame(data2)
df4 = df3[(df3['A'] > 5) & (df3['B'] < 10)]

df4

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [21]:
df5 = pd.DataFrame({'values' : [23,43,57,54,25,23,61]})
print('Mean of the given data is :',df5['values'].mean())
print('median of the given data is :',df5['values'].median())
print('standard deviation of the given data is :',df5['values'].std())

Mean of the given data is : 40.857142857142854
median of the given data is : 43.0
standard deviation of the given data is : 16.994396835708052

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [36]:
d1 = {'Date':['01-7-2023','02-7-2023','03-7-2023','04-7-2023','05-7-2023','06-7-2023','07-7-2023'],
      'Sales':[1000,2500,1200,2700,3200,1500,1700]}
df5=pd.DataFrame(d1)

def moving_avg(df5):
    window_size=7
    df5['MovingAverage'] = df5['Sales'].rolling(window=window_size,min_periods=1).mean()
    return df5
moving_avg(df5)

        Date  Sales  MovingAverage
0  01-7-2023   1000    1000.000000
1  02-7-2023   2500    1750.000000
2  03-7-2023   1200    1566.666667
3  04-7-2023   2700    1850.000000
4  05-7-2023   3200    2120.000000
5  06-7-2023   1500    2016.666667
6  07-7-2023   1700    1971.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [111]:
date_data = pd.DataFrame({'Date':['01-01-2023','01-02-2023','01-03-2023',
                            '01-04-2023','01-05-2023']})
def weekdays(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekdays'] = df['Date'].dt.strftime('%A')
    return df
weekdays(date_data)

        Date   Weekdays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains Dates, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [144]:
date = pd.date_range(start='2023-01-01',
                     end='2023-03-31',
                     freq='D')
z = {'Date':date}
date = pd.DataFrame(z)

def selected_rows(date):
    selc = date[(date['Date'] >= '2023-01-01') & (date['Date'] <= '2023-01-31')]
    return selc
selected_rows(date)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Answer:- The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is the Pandas library itself. Pandas is a powerful data manipulation and analysis library in Python, and it serves as the foundation for performing various operations on structured data.